{
  "title": "INGENIERO EN FULLSTACK + MÓVIL",
  "about": "Desarrollador que promueve prácticas de ingeniería saludables y sostenibles. Me esfuerzo por fomentar equipos inclusivos, comprometidos, colaborativos y autónomos que generen trabajo de calidad.",
  "experience": "EXPERIENCIA",
  "skills": "HABILIDADES",
  "projects": "PROYECTOS ANTERIORES",
  "education": "EDUCACIÓN",
  "community": {
    "title": "Comunidad",
    "item1": {
      "title": "Ponente en la Conferencia Pride@GitHub",
      "description": "Compartió ideas sobre prácticas tecnológicas inclusivas y representación LGBTQ+ en la industria."
    },
    "item2": {
      "title": "Organizador del Meetup Gay Geeks Tech",
      "description": "Santa Mónica (en pausa, de vuelta para el Orgullo 2025). Fomenta una comunidad de apoyo para profesionales LGBTQ+ en tecnología."
    },
    "item3": {
      "title": "Miembro del Comité Fundador del Primer Orgullo de Santa Mónica",
      "description": "Contribuyó al establecimiento y organización de SaMo Pride, promoviendo la visibilidad y la inclusión."
    }
  },
  "viewProject": "Ver Proyecto",
  "more": "más",
  "menu": {
    "about": "Acerca de",
    "experience": "Experiencia",
    "skills": "Habilidades",
    "projects": "Proyectos",
    "education": "Educación",
    "community": "Comunidad"
  },
  "experience1": {
    "title": "INGENIERO DE SOFTWARE PRINCIPAL SENIOR",
    "company": "WEST MONROE",
    "period": "Enero 2022 - Mayo 2024",
    "description1": "Como Desarrollador Líder, creé un prototipo rápido para un Panel de Herramientas de Precios interno que estimaba costos y márgenes de proyectos de consultoría. Recluté diseñadores y lo llevé a producción como la plataforma oficial de precios de propuestas para West Monroe. La pila tecnológica (Remix + AWS) equilibró velocidad, paridad de características y priorización brutal: programar como si pudiéramos cerrar mañana.",
    "description2": "En una Startup Fintech (recientemente salió a bolsa), Ingeniero Senior en el equipo que desarrolló una plataforma de comercio de capital privado. Creación de interfaces renderizadas en servidor rápidas con React para elementos interactivos complejos, enfatizando el rendimiento altamente escalable y el cumplimiento de SOX.",
    "description3": "Desarrollador Senior para la plataforma de visualización orbital 3D de un cliente aeroespacial, combinando experiencias interactivas fluidas con animaciones complejas y componentes de UI personalizados para modelar satélites, cohetes y desechos espaciales en tiempo real.",
    "description4": "Mentoría a ingenieros en EE. UU. y Costa Rica, con 3/5 de los ingenieros logrando promociones a posiciones Senior, a través de sesiones quincenales 1:1, revisiones de código y sesiones de programación en pareja."
  },
  "experience2": {
    "title": "INGENIERO DE SOFTWARE SENIOR",
    "company": "CARBON FIVE",
    "period": "Marzo 2018 - Enero 2022",
    "description1": "Lideré actualizaciones críticas de cumplimiento SOX y modernización para el Panel de Planes y Ofertas de una importante empresa de streaming con más de 53,6 millones de suscriptores, con enfoque en optimización de rendimiento y principios de diseño responsivo, ejecutando actualizaciones de pila completa de Python 2 a 3 y de KnockoutJS a React/Typescript. Capacité y elevé equipos de desarrollo mediante documentación, programación en pareja y charlas técnicas.",
    "description2": "En una startup Fintech, produje una gestión de estado compleja con flujos asíncronos, asegurando un riguroso cumplimiento financiero. También implementé la capacidad ACATS.",
    "description3": "Desarrollé un frontend React basado en GraphQL para una conocida compañía de producción de entretenimiento, diseñando estrategias de obtención de datos y gestión de estado de alto rendimiento."
  },
  "experience3": {
    "title": "INGENIERO DE SOFTWARE SENIOR",
    "company": "YP",
    "period": "Julio 2010 - Diciembre 2017",
    "description1": "Parte del grupo central de desarrollo. Apoyando a más de 60 millones de usuarios mensuales a través de servicios distribuidos altamente escalables, centrándome en la optimización del rendimiento y principios de diseño responsivo.",
    "description2": "Entre los proyectos individuales: migré el CMS y Herramienta de Administración del sitio de Ruby on Rails a Node.js + MongoDB, permitiendo la contribución del equipo de desarrollo y logrando una mejora del 40% en los ciclos de implementación y actualizaciones de marketing más rápidas (ahora instantáneas)."
  },
  "experience4": {
    "title": "INGENIERO DE CONFIGURACIÓN DE SOFTWARE",
    "company": "YAHOO!",
    "period": "Octubre 2007 - Julio 2010",
    "description1": "Construí y optimicé pipelines de automatización de compilación que redujeron drásticamente los tiempos del ciclo de lanzamiento y abrieron el camino para pipelines de preparación y producción de código \"configurar y olvidar\" a múltiples CDN en todo el mundo",
    "description2": "Lideré la migración de CVS a Subversion, creé scripts de conversión y materiales de capacitación que permitieron una transición fluida para los equipos de desarrollo"
  },
  "experience5": {
    "title": "INGENIERO DE SOFTWARE",
    "company": "EARTHLINK, INC",
    "period": "Noviembre 1998 - Septiembre 2007",
    "description1": "Responsable de la construcción y despliegue de aplicaciones web Java empresariales y mantenimiento de la infraestructura de CI (Maven, Jenkins), impulsando la eficiencia de desarrollo para 3 equipos de productos",
    "description2": "Impulsé la modernización del control de versiones de CVS a Subversion mientras obtenía la certificación ITIL y completaba la capacitación en gestión de proyectos"
  },
  "project1": {
    "title": "Fender : Fender Play",
    "description": "Olvídate de 'Mary Had A Little Lamb'. Elige cualquier guitarra y aprende a tocar tu canción favorita.",
    "altText": "Demostración animada de la interfaz de la aplicación Fender Play, mostrando lecciones de guitarra y características interactivas"
  },
  "project2": {
    "title": "Slingshot Aerospace : Slingshot Laboratory",
    "description": "Aprende los fundamentos de la astrodinámica y experimenta.",
    "altText": "Visualización animada del entorno espacial 3D de Slingshot Laboratory, mostrando mecánica orbital y trayectorias de satélites"
  },
  "project3": {
    "title": "Team Coco : Conan Classic",
    "description": "Los mejores clips de más de 25 años de televisión innovadora.",
    "altText": "Presentación animada del sitio web Conan Classic, con clips y momentos destacados de los programas de Conan O'Brien"
  }
}