{
  "name": "RICO RODRIQUEZ COLLINS",
  "title": "ERFAHRENER FULL-STACK- UND MOBILE-INGENIEUR",
  "about": "Entwickler, der sich für gesunde, nachhaltige Entwicklungspraktiken einsetzt. Ich strebe die Förderung integrativer, engagierter, kooperativer und eigenverantwortlicher Teams an, die qualitativ hochwertige Arbeit leisten können.",
  "experience": "ERFAHRUNG",
  "skills": "FÄHIGKEITEN",
  "projects": "VERGANGENE PROJEKTE",
  "education": "AUSBILDUNG",
  "community": {
    "title": "Gemeinschaft",
    "item1": {
      "title": "Konferenzsprecher bei Pride@GitHub",
      "description": "Teilte Einblicke in inklusive Technologiepraktiken und LGBTQ+-Repräsentation in der Branche."
    },
    "item2": {
      "title": "Organisator des Gay Geeks Tech Meetup",
      "description": "Santa Monica (pausiert, zurück für Pride 2025). Förderung einer unterstützenden Gemeinschaft für LGBTQ+-Technikfachleute."
    },
    "item3": {
      "title": "Mitglied des Gründungskomitees des ersten Santa Monica Pride",
      "description": "Trug zur Gründung und Organisation von SaMo Pride bei und förderte Sichtbarkeit und Inklusion."
    }
  },
  "viewProject": "Projekt ansehen",
  "more": "mehr",
  "menu": {
    "about": "Über mich",
    "experience": "Erfahrung",
    "skills": "Fähigkeiten",
    "projects": "Projekte",
    "education": "Ausbildung",
    "selectLanguage": "Sprache auswählen",
    "community": "Gemeinschaft"
  },
  "experience1": {
    "title": "LEITENDER PRINCIPAL SOFTWARE ENGINEER",
    "company": "WEST MONROE",
    "period": "Januar 2022 - Mai 2024",
    "description1": "Als Lead-Entwickler erstellte ich einen schnellen Prototyp für ein internes Preistool-Dashboard, das Beratungsprojektkosten und -margen schätzte. Rekrutierte Designer und führte es als offizielle Preisplattform für West Monroe in die Produktion ein. Der Stack (Remix + AWS) balancierte Geschwindigkeit, Funktionsparität und brutale Priorisierung: Code, als ob wir morgen eingestellt werden könnten.",
    "description2": "Bei einem Fintech-Startup (kürzlich an die Börse gegangen) Senior Engineer im Team, das eine Private-Equity-Handelsplattform entwickelte. Erstellung schneller serverseitig gerendeter Schnittstellen mit React für komplexe interaktive Elemente, mit Schwerpunkt auf hochskalierbarer Leistung und SOX-Konformität.",
    "description3": "Senior-Entwickler für die 3D-Orbitalvisualisierungsplattform eines Luft- und Raumfahrtkunden, die flüssige interaktive Erfahrungen mit komplexen Animationen und benutzerdefinierten UI-Komponenten für die Modellierung von Satelliten, Raketen und Weltraumschrott in Echtzeit kombiniert.",
    "description4": "Mentorte Ingenieure in den USA und Costa Rica, wobei 3/5 der Ingenieure durch zweiwöchentliche 1:1-Sitzungen, Code-Reviews und Pair-Programming-Sitzungen Beförderungen in Senior-Positionen erreichten."
  },
  "experience2": {
    "title": "SENIOR SOFTWARE ENGINEER",
    "company": "CARBON FIVE",
    "period": "März 2018 - Januar 2022",
    "description1": "Leitete kritische SOX-Compliance-Updates und Modernisierung für das Plans & Offerings Dashboard eines großen Streaming-Unternehmens mit 53,6 Mio.+ Abonnenten, mit Fokus auf Leistungsoptimierung und responsive Design-Prinzipien, führte Full-Stack-Upgrades von Python 2 auf 3 und KnockoutJS auf React/Typescript durch. Schulte und verbesserte Entwicklungsteams durch Dokumentation, Pair Programming und Tech Talks.",
    "description2": "Bei einem Fintech-Startup entwickelte komplexes State Management mit asynchronen Abläufen und stellte strenge finanzielle Compliance sicher. Implementierte auch ACATS-Fähigkeit.",
    "description3": "Entwickelte GraphQL-basiertes React-Frontend für ein bekanntes Unterhaltungsproduktionsunternehmen und entwickelte hochleistungsfähige Datenabfrage- und State-Management-Strategien."
  },
  "experience3": {
    "title": "SENIOR SOFTWARE ENGINEER",
    "company": "YP",
    "period": "Juli 2010 - Dezember 2017",
    "description1": "Teil der Kernentwicklungsgruppe. Unterstützung von 60 Mio.+ monatlichen Nutzern durch hochskalierbare verteilte Dienste, mit Fokus auf Leistungsoptimierung und responsive Design-Prinzipien.",
    "description2": "Unter den Einzelprojekten: Migration des CMS & Admin-Tools der Website von Ruby on Rails zu Node.js + MongoDB, Ermöglichung von Entwicklerteam-Beiträgen und Erreichung einer 40%igen Verbesserung der Bereitstellungszyklen und schnelleren (jetzt sofortigen) Marketing-Updates."
  },
  "experience4": {
    "title": "SOFTWARE-KONFIGURATIONSINGENIEUR",
    "company": "YAHOO!",
    "period": "Oktober 2007 - Juli 2010",
    "description1": "Entwickelte und optimierte Build-Automatisierungspipelines, die die Freigabezykluszeiten drastisch reduzierten und den Weg für \"set it and forget it\" Code-Staging und Produktions-Pipelines zu mehreren CDNs weltweit ebneten",
    "description2": "Leitete die Migration von CVS zu Subversion, erstellte Konvertierungsskripte und Schulungsmaterialien, die einen reibungslosen Übergang für Entwicklungsteams ermöglichten"
  },
  "experience5": {
    "title": "SOFTWARE-INGENIEUR",
    "company": "EARTHLINK, INC",
    "period": "November 1998 - September 2007",
    "description1": "Verantwortlich für den Aufbau und die Bereitstellung von Enterprise-Java-Webanwendungen und die Wartung der CI-Infrastruktur (Maven, Jenkins), was die Entwicklungseffizienz für 3 Produktteams vorantrieb",
    "description2": "Trieb die Modernisierung der Versionskontrolle von CVS zu Subversion voran, während gleichzeitig die ITIL-Zertifizierung erreicht und Projektmanagement-Schulungen abgeschlossen wurden"
  },
  "project1": {
    "title": "Fender : Fender Play",
    "description": "Vergessen Sie 'Mary Had A Little Lamb'. Wählen Sie eine beliebige Gitarre und lernen Sie, Ihren Lieblingssong zu spielen.",
    "altText": "Animierte Demonstration der Fender Play App-Oberfläche, die Gitarrenunterricht und interaktive Funktionen zeigt"
  },
  "project2": {
    "title": "Slingshot Aerospace : Slingshot Laboratory",
    "description": "Lernen Sie die Grundlagen der Astrodynamik und experimentieren Sie.",
    "altText": "Animierte Visualisierung der 3D-Weltraumumgebung von Slingshot Laboratory, die Orbitalmechanik und Satellitenbahnen zeigt"
  },
  "project3": {
    "title": "Team Coco : Conan Classic",
    "description": "Die besten Clips aus über 25 Jahren bahnbrechendem Fernsehen.",
    "altText": "Animierte Präsentation der Conan Classic Website mit Clips und Highlights aus Conan O'Briens Shows"
  }
}