{
  "name": "RICO RODRIQUEZ COLLINS",
  "title": "EXPERIENCED FULL STACK & MOBILE ENGINEER",
  "about": "Technical leader who champions sustainable engineering practices through empathy and collaboration. I excel at fostering team environments where open communication drives innovation and inclusivity enables everyone's best work.",
  "experience": "EXPERIENCE",
  "skills": "SKILLS",
  "projects": "PAST PROJECTS",
  "education": "EDUCATION",
  "viewProject": "View Project",
  "more": "more",
  "menu": {
    "about": "About",
    "experience": "Experience",
    "skills": "Skills",
    "projects": "Projects",
    "education": "Education",
    "selectLanguage": "Select language",
    "community": "Community"
  },
  "community": {
    "title": "Community",
    "item1": {
      "title": "Conference Speaker at Pride@GitHub",
      "description": "Shared insights on inclusive tech practices and LGBTQ+ representation in the industry."
    },
    "item2": {
      "title": "Organizer of Gay Geeks Tech Meetup",
      "description": "Santa Monica (on hiatus, back for Pride 2025). Fostering a supportive community for LGBTQ+ tech professionals."
    },
    "item3": {
      "title": "Member of The First Santa Monica Pride Founding Committee",
      "description": "Contributed to the establishment and organization of SaMo Pride, promoting visibility and inclusion."
    }
  },
  "experience1": {
    "title": "SENIOR PRINCIPAL SOFTWARE ENGINEER",
    "company": "WEST MONROE",
    "period": "January 2022 - May 2024",
    "description1": "As Lead Developer, created rapid prototype for an internal Pricing Tool Dashboard that estimated consulting project costs and margins. Recruited designers, and shepherded it into production as the official proposal pricing platform for West Monroe. The stack (Remix + AWS) balanced speed, feature parity, and brutal prioritization: code as if we could be shut down tomorrow.",
    "description2": "At Fintech Startup (just recently went public), Senior Engineer on team that developed private equity trading platform. Creating fast server-rendered interfaces with React for complex interactive elements, emphasizing highly-scalable performance and SOX compliance.",
    "description3": "Senior Dev for an aerospace client's 3D orbital visualization platform, blending a fluid interactive experiences with complex animations and custom UI components for modelling satellites, rockets, and space debris in real-time.",
    "description4": "Mentored engineers across US and Costa Rica, with 3/5 of engineers achieving promotions to Senior positions, through bi-weekly 1: 1 sessions, code reviews, and pair-programming sessions."
  },
  "experience2": {
    "title": "SENIOR SOFTWARE ENGINEER",
    "company": "CARBON FIVE",
    "period": "March 2018 - January 2022",
    "description1": "Led critical SOX-compliance updates and modernization for the Plans & Offerings Dashboard of a major streaming company with 53.6M+ subscribers, with a focus on performance optimization and responsive design principles executing full-stack upgrades from Python 2 to 3 and KnockoutJS to React/Typescript. Trained and leveled up development teams via docs, pair programming, and Tech Talks",
    "description2": "At a Fintech startup, produced complex state management with asynchronous flows, ensuring rigorous financial compliance. Also implemented ACATS ability.",
    "description3": "Developed GraphQL-based React frontend for a well-known entertainment production company, engineering highly performant data fetching and state management strategies "
  },
  "experience3": {
    "title": "SENIOR SOFTWARE ENGINEER",
    "company": "YP",
    "period": "July 2010 - December 2017",
    "description1": "Part of core development group. Supporting 60M+ monthly users through highly scalable distributed services, focusing on performance optimization and responsive design principles.",
    "description2": "Amongst solo projects: migrated site's CMS & Admin Tool from Ruby on Rails to Node.js + MongoDB, enabling Dev team contribution and achieving a 40% improvement in deployment cycles, and faster (now instant) Marketing updates.",
    "description3": ""
  },
  "experience4": {
    "title": "SOFTWARE CONFIGURATION ENGINEER",
    "company": "YAHOO!",
    "period": "October 2007 - July 2010",
    "description1": "Built and optimized build-automation pipelines that drastically reduced release cycle times and made way for \"set it and forget it\" code staging and production Pipelines to multiple CDN's across the globe",
    "description2": "Led migration from CVS to Subversion, created conversion scripts and training materials that enabled smooth transition for development teams"
  },
  "experience5": {
    "title": "SOFTWARE ENGINEER",
    "company": "EARTHLINK, INC",
    "period": "November 1998 - September 2007",
    "description1": "Responsible for building and deploying Enterprise Java web applications and maintained CI infrastructure (Maven, Jenkins), driving development efficiency for 3 product teams",
    "description2": "Drove version control modernization from CVS to Subversion while achieving ITIL certification and completing project management training"
  },
  "project1": {
    "title": "Fender : Fender Play",
    "description": "Forget 'Mary Had A Little Lamb'. Pick any guitar, and learn how to play your favorite song.",
    "altText": "Animated demonstration of Fender Play app interface, showing guitar lessons and interactive features"
  },
  "project2": {
    "title": "Slingshot Aerospace : Slingshot Laboratory",
    "description": "Learn the fundamentals of astrodynamics and experiment.",
    "altText": "Animated visualization of Slingshot Laboratory's 3D space environment, displaying orbital mechanics and satellite trajectories"
  },
  "project3": {
    "title": "Team Coco : Conan Classic",
    "description": "The best clips from over 25 years of cutting-edge television.",
    "altText": "Animated showcase of Conan Classic website, featuring clips and highlights from Conan O'Brien's shows"
  }
}